microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51J18A.atdf
        <register name="INTFLAG" offset="0x2" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag">
          <bitfield name="SINGLEE" caption="Single Bit ECC Error Interrupt" mask="0x1"/>
          <bitfield name="DUALE" caption="Dual Bit ECC Error Interrupt" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x3" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="ECCDIS" caption="ECC Disable" mask="0x1"/>
        </register>
        <register name="ERRADDR" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Error Address">
          <bitfield name="ERRADDR" caption="Error Address" mask="0x1FFFF"/>
        </register>
        <register name="DBGCTRL" offset="0xF" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="ECCDIS" caption="ECC Disable" mask="0x1"/>
          <bitfield name="ECCELOG" caption="ECC Error Log" mask="0x2"/>
        </register>
      </register-group>
    </module>
    <module name="RSTC" id="U2239" version="4.0.0" caption="Reset Controller">
      <register-group name="RSTC" caption="Reset Controller">
        <register name="RCAUSE" offset="0x0" rw="R" size="1" caption="Reset Cause">
          <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
          <bitfield name="BODCORE" caption="Brown Out CORE Detector Reset" mask="0x2"/>
          <bitfield name="BODVDD" caption="Brown Out VDD Detector Reset" mask="0x4"/>
          <bitfield name="NVM" caption="NVM Reset" mask="0x8"/>
          <bitfield name="EXT" caption="External Reset" mask="0x10"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x20"/>
          <bitfield name="SYST" caption="System Reset Request" mask="0x40"/>
          <bitfield name="BACKUP" caption="Backup Reset" mask="0x80"/>
        </register>
        <register name="BKUPEXIT" offset="0x2" rw="R" size="1" initval="0x00" caption="Backup Exit Source">
          <bitfield name="RTC" caption="Real Timer Counter Interrupt" mask="0x2"/>
          <bitfield name="BBPS" caption="Battery Backup Power Switch" mask="0x4"/>
          <bitfield name="HIB" caption="Hibernate" mask="0x80"/>
        </register>
      </register-group>
    </module>
    <module name="RTC" id="U2250" version="2.1.0" caption="Real-Time Counter">
      <register-group name="MODE2_ALARM" size="0x8">
        <register name="ALARM" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE2_ALARM Alarm n Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" values="RTC_MODE2_ALARM_ALARM__HOUR"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register name="MASK" offset="0x4" rw="RW" access="WSYNC" size="1" initval="0x00" caption="MODE2_ALARM Alarm n Mask">
          <bitfield name="SEL" caption="Alarm Mask Selection" mask="0x7" values="RTC_MODE2_ALARM_MASK__SEL"/>
        </register>
      </register-group>
      <register-group class="union" union-tag="RTC.MODE0.CTRLA.MODE" name="RTC" caption="Real-Time Counter">
        <register-group name="MODE0" name-in-module="RTC_MODE0" union-tag-value="0" offset="0"/>
        <register-group name="MODE1" name-in-module="RTC_MODE1" union-tag-value="1" offset="0"/>
        <register-group name="MODE2" name-in-module="RTC_MODE2" union-tag-value="2" offset="0"/>
      </register-group>
      <register-group name="RTC_MODE0" caption="Real-Time Counter - 32-bit Counter with Single 32-bit Compare">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE0 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE0_CTRLA__MODE"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE0_CTRLA__PRESCALER"/>
          <bitfield name="BKTRST" caption="BKUP Registers Reset On Tamper Enable" mask="0x2000"/>
          <bitfield name="GPTRST" caption="GP Registers Reset On Tamper Enable" mask="0x4000"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register name="CTRLB" offset="0x2" rw="RW" size="2" initval="0x0000" caption="MODE0 Control B">
          <bitfield name="GP0EN" caption="General Purpose 0 Enable" mask="0x1"/>
          <bitfield name="GP2EN" caption="General Purpose 2 Enable" mask="0x2"/>
          <bitfield name="DEBMAJ" caption="Debouncer Majority Enable" mask="0x10"/>
          <bitfield name="DEBASYNC" caption="Debouncer Asynchronous Enable" mask="0x20"/>
          <bitfield name="RTCOUT" caption="RTC Output Enable" mask="0x40"/>
          <bitfield name="DMAEN" caption="DMA Enable" mask="0x80"/>
          <bitfield name="DEBF" caption="Debounce Freqnuency" mask="0x700" values="RTC_MODE0_CTRLB__DEBF"/>
          <bitfield name="ACTF" caption="Active Layer Freqnuency" mask="0x7000" values="RTC_MODE0_CTRLB__ACTF"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE0 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
          <bitfield name="TAMPEREO" caption="Tamper Event Output Enable" mask="0x4000"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
          <bitfield name="TAMPEVEI" caption="Tamper Event Input Enable" mask="0x10000"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="MODE0 Interrupt Enable Clear">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register name="INTENSET" offset="0xA" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="MODE0 Interrupt Enable Set">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="MODE0 Interrupt Flag Status and Clear">
          <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
        </register>
